export default {
  regexp: {
    //密码
    email: /^[A-Za-z0-9\u4e00-\u9fa5_-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/,
    password: /^(?:(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])|(?=.*[A-Z])(?=.*[a-z])(?=.*[^A-Za-z0-9])|(?=.*[A-Z])(?=.*[0-9])(?=.*[^A-Za-z0-9])|(?=.*[a-z])(?=.*[0-9])(?=.*[^A-Za-z0-9])).{6,12}$/,
    mobile: /^\d{6,11}$/,
    // 匹配文档中的keyword, 但不包含超链接里面的keyword
    htmlKeywordLinked: new RegExp(keyword + '(?!([^<]*>)|([^<]*<\/a>))', 'gm'), // 后向引用，零宽断言
    // 获取script标签中的src
    htmlScriptSrc: /(?<=\<script\s+[^\>]*src=[\'\"])[^\>\'\"]*(?=[\'\"]\s*.*\>)/,
    htmlScriptSrcs: /(?<=\<script\s+[^\>]*src=[\'\"])[^\>\'\"]*(?=[\'\"]\s*.*\>)/g,
    // 获取script标签中的src
    htmlImgSrc: /(?<=\<img\s+[^\>]*src=[\'\"])[^\>\'\"]*(?=[\'\"]\s*.*\>)/,
    htmlImgSrcs: /(?<=\<img\s+[^\>]*src=[\'\"])[^\>\'\"]*(?=[\'\"]\s*.*\>)/g,
    // 获取页面中所有的src
    htmlSrc: /(?<=\<\w+\s+[^\>]*src=[\'\"])[^\'\"]*(?=[\'\"]\s*.*\>)/,
    htmlSrcs: /(?<=\<\w+\s+[^\>]*src=[\'\"])[^\'\"]*(?=[\'\"]\s*.*\>)/g,
    // 获取link标签中的href
    htmlLinkHref: /(?<=\<link\s+[^\>]*href=[\'\"])[^\>\'\"]*(?=[\'\"]\s*.*\>)/,
    htmlLinkHrefs: /(?<=\<link\s+[^\>]*href=[\'\"])[^\>\'\"]*(?=[\'\"]\s*.*\>)/g,
    // html中的url，css中的背景图地址，字体文件地址等
    htmlUrl: /(?<=\burl\([\"\']*)[^\'\"]*(?=[\"\']*\))/,
    htmlUrls: /(?<=\burl\([\"\']*)[^\'\"]*(?=[\"\']*\))/g,
    // html文件中的路径
    htmlPaths: /(?<=\<\w+\s+[^\>]*src=[\'\"])[^\'\"]*(?=[\'\"]\s*.*\>)|(?<=\<link\s+[^\>]*href=[\'\"])[^\>\'\"]*(?=[\'\"]\s*.*\>)|(?<=\burl\([\"\']*)[^\'\"]*(?=[\"\']*\))/g
  }
}
